test/tests/simple_multiapp/serial/buoyantCavity/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    patch0
    {
        type            noSlip;
    }
    patch1
    {
        type            noSlip;
    }
    patch2
    {
        type            noSlip;
    }
    patch3
    {
        type            noSlip;
    }
    patch4
    {
        type            noSlip;
    }
    patch5
    {
        type            noSlip;
    }
}


// ************************************************************************* //
